'use client';

import { useRef, useEffect } from 'react';

import { Splide, SplideSlide, SplideTrack } from '@splidejs/react-splide';
import type { Splide as SplideCore } from '@splidejs/splide';
import '@splidejs/react-splide/css';

import styles from './Single.module.sass';
import Image from 'next/image';
import Link from 'next/link';
import { useLangRouting } from '@/lib/i18n/useLangRouting';

type Slide = {
	id: number;
	img: string;
	alt: string;
};

const slides: Slide[] = [
	{ id: 1, img: '/img/car-item.jpg', alt: 'Car 1' },
	{ id: 2, img: '/img/car-item.jpg', alt: 'Car 2' },
	{ id: 3, img: '/img/car-item.jpg', alt: 'Car 3' },
	{ id: 4, img: '/img/car-item.jpg', alt: 'Car 4' },
	{ id: 5, img: '/img/car-item.jpg', alt: 'Car 5' },
	{ id: 6, img: '/img/car-item.jpg', alt: 'Car 6' },
	{ id: 7, img: '/img/car-item.jpg', alt: 'Car 7' },
	{ id: 8, img: '/img/car-item.jpg', alt: 'Car 8' }
];

export default function Single() {
	const mainRef = useRef<InstanceType<typeof Splide> | null>(null);
	const thumbsRef = useRef<InstanceType<typeof Splide> | null>(null);

	useEffect(() => {
		if (mainRef.current?.splide && thumbsRef.current?.splide) {
			const main = mainRef.current.splide as SplideCore;
			const thumbs = thumbsRef.current.splide as SplideCore;
			main.sync(thumbs);
		}
	}, []);

	const { href } = useLangRouting();

	return (
		<section className={styles.single}>
			<div className="container">
				<div className={styles.head}>
					<ul className={styles.breadcrumbs}>
						<li>
							<Link href={href('/')}>Забронировать авто</Link>
						</li>
						<li>
							<Link href="#">Mercedes E-class</Link>
						</li>
					</ul>
					<h2 className={styles.title}>Mercedes E-class</h2>
				</div>
				<div className={styles.main}>
					<div className={styles.gallery}>
						<Splide
							options={{
								type: 'fade',
								rewind: true,
								pagination: false,
								arrows: true
							}}
							ref={mainRef}
							className={styles.galleryMain}
							hasTrack={false}
						>
							<SplideTrack>
								{slides.map((slide) => (
									<SplideSlide key={slide.id}>
										<img src={slide.img} alt={slide.alt} />
									</SplideSlide>
								))}
							</SplideTrack>
							<div className="splide__arrows">
								<button className="splide__arrow splide__arrow--prev">
									<svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M7.71985 8.76817C8.09338 8.34394 8.09338 7.65605 7.71985 7.23182L1.63283 0.318212C1.25928 -0.10607 0.653679 -0.10607 0.280124 0.318212C-0.0933829 0.74244 -0.0933824 1.43033 0.280172 1.85456L5.69084 8L0.280172 14.1455C-0.0933824 14.5697 -0.0933824 15.2576 0.280172 15.6818C0.653679 16.1061 1.25932 16.1061 1.63283 15.6818L7.71985 8.76817ZM6.08703 9.08637H7.04352V6.91363H6.08703V9.08637Z"
											fill="var(--arrow-color)"
										/>
									</svg>
								</button>
								<button className="splide__arrow splide__arrow--next">
									<svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M7.71985 8.76817C8.09338 8.34394 8.09338 7.65605 7.71985 7.23182L1.63283 0.318212C1.25928 -0.10607 0.653679 -0.10607 0.280124 0.318212C-0.0933829 0.74244 -0.0933824 1.43033 0.280172 1.85456L5.69084 8L0.280172 14.1455C-0.0933824 14.5697 -0.0933824 15.2576 0.280172 15.6818C0.653679 16.1061 1.25932 16.1061 1.63283 15.6818L7.71985 8.76817ZM6.08703 9.08637H7.04352V6.91363H6.08703V9.08637Z"
											fill="var(--arrow-color)"
										/>
									</svg>
								</button>
							</div>
						</Splide>
						<Splide
							options={{
								rewind: true,
								gap: 12,
								pagination: false,
								arrows: false,
								isNavigation: true,
								perPage: 'auto'
							}}
							ref={thumbsRef}
							className={styles.galleryThumbs}
						>
							{slides.map((slide) => (
								<SplideSlide key={slide.id}>
									<img src={slide.img} alt={slide.alt} />
								</SplideSlide>
							))}
						</Splide>
					</div>
					<div className={styles.block}>
						<div className={styles.blockTitle}>описание</div>
						<div className={styles.description}>
							<p>
								Новый Mercedes-Benz Е-Класс седан — невероятно динамичный, элегантный, роскошный автомобиль, который
								отличается классическим дизайном, высочайшим уровнем безопасности и комфортом премиум-уровня. Благодаря
								превосходным ходовым качествам обновлённого седана Вы испытаете непревзойдённое удовольствие от процесса
								вождения.
							</p>
							<p>
								Mercedes-Benz Е-Класса создан, чтобы легко и уверенно преодолеть любое расстояние и доставить Вас
								в выбранный пункт назначения с максимальным удобством.
							</p>
						</div>
					</div>
					<div className={styles.block}>
						<div className={styles.blockTitle}>Параметры</div>
						<div className={styles.spec}>
							<div className={styles.specItem}>
								<div className={styles.specIcon}>
									<svg width="11" height="24" viewBox="0 0 11 24" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path d="M3.14286 0L0 12.8H4.71429L1.57143 24L11 9.6H6.28571L11 0H3.14286Z" fill="#C9A77F" />
									</svg>
								</div>
								<div className={styles.specInfo}>
									<b>197 л.с.</b>
									<p>Мощность</p>
								</div>
							</div>
							<div className={styles.specItem}>
								<div className={styles.specIcon}>
									<svg width="20" height="14" viewBox="0 0 20 14" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M9.25985 8.23332L0.719491 13.9225C0.649769 13.9689 0.568768 13.9955 0.485116 13.9995C0.401463 14.0035 0.318292 13.9847 0.24446 13.9452C0.170627 13.9057 0.1089 13.847 0.0658506 13.7752C0.0228015 13.7034 4.32624e-05 13.6213 0 13.5376V0.462373C4.32624e-05 0.378694 0.0228015 0.296593 0.0658506 0.224816C0.1089 0.153038 0.170627 0.094271 0.24446 0.0547743C0.318292 0.0152777 0.401463 -0.00346992 0.485116 0.000528517C0.568768 0.00452696 0.649769 0.0311219 0.719491 0.0774802L9.25985 5.76668V0.462373C9.2599 0.378694 9.28266 0.296593 9.3257 0.224816C9.36875 0.153038 9.43048 0.094271 9.50431 0.0547743C9.57815 0.0152777 9.66132 -0.00346992 9.74497 0.000528517C9.82862 0.00452696 9.90962 0.0311219 9.97935 0.0774802L19.7939 6.61511C19.8573 6.65735 19.9093 6.71459 19.9452 6.78173C19.9812 6.84887 20 6.92385 20 7C20 7.07615 19.9812 7.15113 19.9452 7.21827C19.9093 7.28541 19.8573 7.34265 19.7939 7.38489L9.97935 13.9225C9.90962 13.9689 9.82862 13.9955 9.74497 13.9995C9.66132 14.0035 9.57815 13.9847 9.50431 13.9452C9.43048 13.9057 9.36875 13.847 9.3257 13.7752C9.28266 13.7034 9.2599 13.6213 9.25985 13.5376V8.23332Z"
											fill="#C9A77F"
										/>
									</svg>
								</div>
								<div className={styles.specInfo}>
									<b>7.6 сек</b>
									<p>Разгон до 100 км/ч</p>
								</div>
							</div>
							<div className={styles.specItem}>
								<div className={styles.specIcon}>
									<svg width="18" height="20" viewBox="0 0 18 20" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M2 4V3.5C2 2.557 2 2.086 2.293 1.793C2.586 1.5 3.057 1.5 4 1.5C4.943 1.5 5.414 1.5 5.707 1.793C6 2.086 6 2.557 6 3.5V4"
											fill="#C9A77F"
										/>
										<path d="M12 3H15Z" fill="#C9A77F" />
										<path
											d="M13 0H11.667C9.793 0 9 0.934 9 2.667C9 3.533 8.603 4 7.667 4H4C2.114 4 1.172 4 0.586 4.586C-5.96046e-08 5.172 0 6.114 0 8V13C0 16.3 1.19209e-07 17.95 1.025 18.975C2.05 20 3.7 20 7 20H11C14.3 20 15.95 20 16.975 18.975C18 17.95 18 16.3 18 13V5C18 2.643 18 1.464 17.268 0.732C16.535 1.19209e-07 15.357 0 13 0Z"
											fill="#C9A77F"
										/>
										<path
											d="M6 12.587C6 11.123 7.264 9.676 8.15 8.84C8.37888 8.62117 8.68334 8.49904 9 8.49904C9.31666 8.49904 9.62112 8.62117 9.85 8.84C10.736 9.676 12 11.123 12 12.587C11.9974 12.9762 11.9175 13.361 11.7647 13.7189C11.612 14.0769 11.3895 14.4009 11.1103 14.672C10.8311 14.9431 10.5007 15.156 10.1384 15.2981C9.77606 15.4403 9.38909 15.5089 9 15.5C7.136 15.5 6 14.023 6 12.587Z"
											fill="#C9A77F"
										/>
									</svg>
								</div>
								<div className={styles.specInfo}>
									<b>Дизель</b>
									<p>Тип топлива</p>
								</div>
							</div>
							<div className={styles.specItem}>
								<div className={styles.specIcon}>
									<svg width="22" height="20" viewBox="0 0 22 20" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M3.66667 17.5V18.125C3.66667 18.6458 3.48863 19.0887 3.13256 19.4537C2.77648 19.8187 2.34341 20.0008 1.83333 20C1.32326 19.9992 0.890593 19.8171 0.535333 19.4537C0.180074 19.0904 0.00162963 18.6475 0 18.125V9.1875C0 9.04167 0.0101853 8.89583 0.0305557 8.75C0.050926 8.60417 0.0814814 8.46875 0.122222 8.34375L2.41389 1.6875C2.57685 1.1875 2.87222 0.78125 3.3 0.46875C3.72778 0.15625 4.20648 0 4.73611 0H17.2639C17.7935 0 18.2722 0.15625 18.7 0.46875C19.1278 0.78125 19.4231 1.1875 19.5861 1.6875L21.8778 8.34375C21.9185 8.46875 21.9491 8.60417 21.9694 8.75C21.9898 8.89583 22 9.04167 22 9.1875V18.125C22 18.6458 21.822 19.0887 21.4659 19.4537C21.1098 19.8187 20.6767 20.0008 20.1667 20C19.6566 19.9992 19.2239 19.8171 18.8687 19.4537C18.5134 19.0904 18.335 18.6475 18.3333 18.125V17.5H3.66667ZM3.42222 6.25H18.5778L17.2944 2.5H4.70556L3.42222 6.25ZM5.5 13.75C6.00926 13.75 6.44233 13.5679 6.79922 13.2037C7.15611 12.8396 7.33415 12.3967 7.33333 11.875C7.33252 11.3533 7.15448 10.9108 6.79922 10.5475C6.44396 10.1842 6.01089 10.0017 5.5 10C4.98911 9.99833 4.55644 10.1808 4.202 10.5475C3.84756 10.9142 3.66911 11.3567 3.66667 11.875C3.66422 12.3933 3.84267 12.8362 4.202 13.2037C4.56133 13.5712 4.994 13.7533 5.5 13.75ZM16.5 13.75C17.0093 13.75 17.4423 13.5679 17.7992 13.2037C18.1561 12.8396 18.3341 12.3967 18.3333 11.875C18.3325 11.3533 18.1545 10.9108 17.7992 10.5475C17.444 10.1842 17.0109 10.0017 16.5 10C15.9891 9.99833 15.5564 10.1808 15.202 10.5475C14.8476 10.9142 14.6691 11.3567 14.6667 11.875C14.6642 12.3933 14.8427 12.8362 15.202 13.2037C15.5613 13.5712 15.994 13.7533 16.5 13.75Z"
											fill="#C9A77F"
										/>
									</svg>
								</div>
								<div className={styles.specInfo}>
									<b>Седан</b>
									<p>Тип кузова</p>
								</div>
							</div>
							<div className={styles.specItem}>
								<div className={styles.specIcon}>
									<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M12.6678 0C12.8386 0.0655974 13.0474 0.0408511 13.2273 0.0591162C18.8394 0.625925 23.3784 5.15705 23.9409 10.7727C23.959 10.9528 23.9344 11.1614 24 11.3322V12.6678C23.9344 12.8386 23.9591 13.0474 23.9409 13.2273C23.3741 18.8398 18.8424 23.3784 13.2273 23.9409C13.0472 23.959 12.8386 23.9344 12.6678 24H11.3322C11.1614 23.9344 10.9526 23.9591 10.7727 23.9409C5.1602 23.3741 0.621604 18.8424 0.0591162 13.2273C0.0410475 13.0472 0.0655974 12.8386 0 12.6678V11.3322C0.0640262 11.1586 0.0404583 10.9555 0.0591162 10.7727C0.629853 5.14527 5.14998 0.637316 10.7727 0.0591162C10.9577 0.0400655 11.1559 0.0628478 11.3322 0H12.6678ZM11.4852 3.01061C7.47378 3.22448 4.00321 6.23352 3.1907 10.1531C1.87719 16.4895 7.49283 22.1116 13.8304 20.8124C17.2875 20.1036 20.093 17.3012 20.8091 13.8467C22.0113 8.04786 17.3794 2.69637 11.4852 3.01061Z"
											fill="#C9A77F"
										/>
										<path
											d="M11.7209 4.01225C14.507 3.93428 17.1026 5.24878 18.6507 7.55863C21.2661 11.4617 19.9227 16.7865 15.8302 19.0215C11.1307 21.5878 5.2411 18.8445 4.16975 13.6335C3.17636 8.80105 6.78343 4.15012 11.7209 4.01205V4.01225ZM11.6227 5.05316C11.1032 5.07948 10.3628 5.18652 9.87809 5.37074C9.44719 5.53454 9.51416 5.87627 9.56719 6.25277C9.76281 7.64505 10.7902 9.36315 12.4327 8.98586C13.6947 8.69598 14.3941 7.11968 14.4742 5.94089C14.5121 5.38252 13.9864 5.31162 13.5521 5.21382C12.9327 5.07437 12.2579 5.02115 11.6227 5.05336V5.05316ZM7.49871 6.81958C7.28719 6.82979 7.02441 7.11595 6.88359 7.26658C6.11155 8.09284 5.47541 9.22547 5.2142 10.3304C5.1321 10.6776 5.07888 10.9402 5.44673 11.1394C6.36235 11.6349 8.13033 11.6624 8.88745 10.8613C9.92484 9.76361 8.78886 7.94946 7.97341 7.06135C7.85282 6.93015 7.68922 6.81054 7.49891 6.81978L7.49871 6.81958ZM16.375 6.83981C16.3361 6.84531 16.2905 6.86043 16.2542 6.87614C16.1026 6.94154 15.7591 7.37323 15.6448 7.52367C15.0477 8.30946 14.3438 9.59981 14.8965 10.5667C15.4912 11.6072 17.2246 11.6477 18.2255 11.2828C18.9392 11.0225 18.9207 10.8092 18.731 10.1301C18.4384 9.08229 17.8578 8.05964 17.1166 7.26658C16.9121 7.0478 16.7049 6.79248 16.3752 6.84L16.375 6.83981ZM11.9572 10.002C10.1817 10.0498 9.33898 12.2229 10.6346 13.454C11.6351 14.4045 13.2958 14.0463 13.8361 12.7852C14.4016 11.4652 13.3938 9.96334 11.9574 10.0018L11.9572 10.002ZM16.6311 12.5165C15.6811 12.5918 14.7415 13.0957 14.6899 14.1498C14.6447 15.0748 15.4274 16.2903 16.0358 16.9495C16.2844 17.2189 16.5559 17.2462 16.8418 17.0086C17.675 16.3161 18.4421 14.9042 18.731 13.8699C18.8327 13.506 18.9916 13.1069 18.5805 12.8728C18.063 12.578 17.2183 12.47 16.6311 12.5165ZM6.94369 16.8591C7.24497 17.1692 7.52326 17.4674 7.93492 17.0577C8.52353 16.4718 9.28477 15.2267 9.30893 14.3861C9.36412 12.4633 6.73826 12.2587 5.44654 12.9394C4.98539 13.1823 5.17924 13.6588 5.29688 14.0581C5.60326 15.0976 6.19286 16.0867 6.94349 16.8593L6.94369 16.8591ZM11.7993 15.0104C10.8461 15.1006 10.1177 16.005 9.80503 16.846C9.6758 17.1938 9.50867 17.8527 9.52457 18.217C9.54284 18.6363 9.99358 18.7127 10.3223 18.794C11.4187 19.0653 12.5978 19.0635 13.6933 18.7899C14.0856 18.6919 14.5033 18.6212 14.4744 18.118C14.3937 16.7146 13.442 14.8551 11.7993 15.0104Z"
											fill="#C9A77F"
										/>
									</svg>
								</div>
								<div className={styles.specInfo}>
									<b>Задний</b>
									<p>Привод</p>
								</div>
							</div>
							<div className={styles.specItem}>
								<div className={styles.specIcon}>
									<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M10 0C11.3261 0 12.5979 0.526784 13.5355 1.46447C14.4732 2.40215 15 3.67392 15 5C15 6.32608 14.4732 7.59785 13.5355 8.53553C12.5979 9.47322 11.3261 10 10 10C8.67392 10 7.40215 9.47322 6.46447 8.53553C5.52678 7.59785 5 6.32608 5 5C5 3.67392 5.52678 2.40215 6.46447 1.46447C7.40215 0.526784 8.67392 0 10 0ZM10 12.5C15.525 12.5 20 14.7375 20 17.5V20H0V17.5C0 14.7375 4.475 12.5 10 12.5Z"
											fill="#C9A77F"
										/>
									</svg>
								</div>
								<div className={styles.specInfo}>
									<b>5</b>
									<p>Количество мест</p>
								</div>
							</div>
						</div>
					</div>
					<div className={styles.block}>
						<div className={styles.blockTitle}>Условия аренды</div>
						<Splide
							className={styles.conditions}
							options={{
								type: 'loop',
								perPage: 2,
								perMove: 1,
								gap: '12px',
								pagination: false,
								arrows: true,
								speed: 800
							}}
							aria-label="Отзывы"
							hasTrack={false}
						>
							<SplideTrack>
								<SplideSlide>
									<div className={styles.conditionsCard}>
										<div className={styles.conditionsIcon}>
											<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path
													d="M10 0C11.3261 0 12.5979 0.526784 13.5355 1.46447C14.4732 2.40215 15 3.67392 15 5C15 6.32608 14.4732 7.59785 13.5355 8.53553C12.5979 9.47322 11.3261 10 10 10C8.67392 10 7.40215 9.47322 6.46447 8.53553C5.52678 7.59785 5 6.32608 5 5C5 3.67392 5.52678 2.40215 6.46447 1.46447C7.40215 0.526784 8.67392 0 10 0ZM10 12.5C15.525 12.5 20 14.7375 20 17.5V20H0V17.5C0 14.7375 4.475 12.5 10 12.5Z"
													fill="#C9A77F"
												/>
											</svg>
										</div>
										<div className={styles.conditionsTitle}>от 23 лет</div>
										<div className={styles.conditionsText}>Минимальный возраст водителя должен быть 23 года.</div>
									</div>
								</SplideSlide>
								<SplideSlide>
									<div className={styles.conditionsCard}>
										<div className={styles.conditionsIcon}>
											<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path
													d="M10 0C11.3261 0 12.5979 0.526784 13.5355 1.46447C14.4732 2.40215 15 3.67392 15 5C15 6.32608 14.4732 7.59785 13.5355 8.53553C12.5979 9.47322 11.3261 10 10 10C8.67392 10 7.40215 9.47322 6.46447 8.53553C5.52678 7.59785 5 6.32608 5 5C5 3.67392 5.52678 2.40215 6.46447 1.46447C7.40215 0.526784 8.67392 0 10 0ZM10 12.5C15.525 12.5 20 14.7375 20 17.5V20H0V17.5C0 14.7375 4.475 12.5 10 12.5Z"
													fill="#C9A77F"
												/>
											</svg>
										</div>
										<div className={styles.conditionsTitle}>от 23 лет</div>
										<div className={styles.conditionsText}>Минимальный возраст водителя должен быть 23 года.</div>
									</div>
								</SplideSlide>
							</SplideTrack>
							<div className="splide__arrows">
								<button className="splide__arrow splide__arrow--prev">
									<svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M7.71985 8.76817C8.09338 8.34394 8.09338 7.65605 7.71985 7.23182L1.63283 0.318212C1.25928 -0.10607 0.653679 -0.10607 0.280124 0.318212C-0.0933829 0.74244 -0.0933824 1.43033 0.280172 1.85456L5.69084 8L0.280172 14.1455C-0.0933824 14.5697 -0.0933824 15.2576 0.280172 15.6818C0.653679 16.1061 1.25932 16.1061 1.63283 15.6818L7.71985 8.76817ZM6.08703 9.08637H7.04352V6.91363H6.08703V9.08637Z"
											fill="var(--arrow-color)"
										/>
									</svg>
								</button>
								<button className="splide__arrow splide__arrow--next">
									<svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M7.71985 8.76817C8.09338 8.34394 8.09338 7.65605 7.71985 7.23182L1.63283 0.318212C1.25928 -0.10607 0.653679 -0.10607 0.280124 0.318212C-0.0933829 0.74244 -0.0933824 1.43033 0.280172 1.85456L5.69084 8L0.280172 14.1455C-0.0933824 14.5697 -0.0933824 15.2576 0.280172 15.6818C0.653679 16.1061 1.25932 16.1061 1.63283 15.6818L7.71985 8.76817ZM6.08703 9.08637H7.04352V6.91363H6.08703V9.08637Z"
											fill="var(--arrow-color)"
										/>
									</svg>
								</button>
							</div>
						</Splide>
					</div>
					<div className={styles.block}>
						<div className={styles.blockTitle}>Стоимость аренды в сутки</div>
						<ul className={styles.price}>
							<li>
								<p>Сутки</p>
								<b>
									12 500 <span>₽</span>
								</b>
							</li>
							<li>
								<p>2-7 дней</p>
								<b>
									12 000 <span>₽</span>
								</b>
							</li>
							<li>
								<p>От 7 дней</p>
								<b>
									11 000 <span>₽</span>
								</b>
								<small>*Залог - 20.000 ₽</small>
							</li>
							<li>
								<p>От 30 суток</p>
								<b>
									12 000 <span>₽</span>
								</b>
							</li>
							<li>
								<p>От 60 суток</p>
								<b>
									12 000 <span>₽</span>
								</b>
							</li>
							<li>
								<p>Стоимость 1 км свыше 200км в день</p>
								<b>
									50 <span>₽/км</span>
								</b>
							</li>
						</ul>
					</div>
				</div>
				<div className={styles.sidebar}>form</div>
			</div>
		</section>
	);
}
